Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_audio.h
/**************************************************************************//**
 * @file     rtl8735bh_audio.h
 * @brief    The HAL related definition and macros for the AUDIO device.
 *           Includes Registers and data type definition.
 * @version  V1.00
 * @date     2016-07-20
 *
 * @note
 *
 ******************************************************************************
 *
 * Copyright(c) 2007 - 2017 Realtek Corporation. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/

#ifndef _RTL8735BH_AUDIO_H_
#define _RTL8735BH_AUDIO_H_

#ifdef __cplusplus
extern "C" {
#endif


#include "basic_types.h"
#include "rtl8735b_sport.h"
#include "rtl8735b_si_type.h"
#include "rtl8735b_syson_s_type.h"
#include "rtl8735b.h"
#include "hal_irq.h"
#include "rtl8735b_audio_codec_type.h"

/**
  \brief  Define the audio port ID.
*/
enum  audio_id_e {
	AUDIO_id   =   0x0,
	AUDIO_Max_Id  =   0x1
};
typedef uint8_t audio_id_t;

/**
  \brief Audio Sample Rate.
*/
enum  audio_sample_rate_e {
	AUDIO_SR_8KHZ       =   0x07,
	AUDIO_SR_11p025KHZ  =   0x0d,
	AUDIO_SR_12KHZ      =   0x0b,
	AUDIO_SR_16KHZ      =   0x05,
	AUDIO_SR_24KHZ      =   0x0a,
	AUDIO_SR_22p05KHZ   =   0x0c,
	AUDIO_SR_32KHZ	    = 	0x03,
	AUDIO_SR_44p1KHZ    =   0x08,
	AUDIO_SR_48KHZ	    =	0x00,
	AUDIO_SR_88p2KHZ	=	0x09,
	AUDIO_SR_96KHZ	    =	0x01
};
typedef uint8_t audio_sample_rate_t;

/**
  \brief Audio Format.
*/
enum  audio_format_e {
	AUDIO_FORMAT_I2S          =   0x0,
	AUDIO_FORMAT_LEFT_JUST    =   0x1,
	AUDIO_FORMAT_PCM_MODE_A   =   0x2,
	AUDIO_FORMAT_PCM_MODE_B   =   0x3
};
typedef uint8_t audio_format_t;

/**
  \brief Audio Word Length.
*/
enum  audio_word_len_e {
	AUDIO_WL_16 = 0x0,
	AUDIO_WL_24 = 0x2,
};
typedef uint8_t audio_word_len_t;

/**
  \brief Audio Channel Select.
*/
enum  audio_sel_ch_e {
	AUDIO_L_R = 0x0,
	AUDIO_R_L = 0x1,
	AUDIO_L_L = 0x2,
	AUDIO_R_R = 0x3
};
typedef uint8_t audio_sel_ch_t;

/**
  \brief Audio DMIC Input Clock Select.
*/
enum  audio_dmic_input_clk_e {
	AUDIO_DMIC_5M       = 0x0,
	AUDIO_DMIC_2p5M     = 0x1,  /*!< default */
	AUDIO_DMIC_1p25M    = 0x2,
	AUDIO_DMIC_625K     = 0x3,
	AUDIO_DMIC_312p5K   = 0x4
};
typedef uint8_t audio_dmic_input_clk_t;

/**
  \brief Audio Zero Detection Function Select.
*/
enum  audio_zdet_e {
	AUDIO_IMME_CHAN             = 0x0,
	AUDIO_DETE_AND_IMME_CHAN    = 0x1,
	AUDIO_DETE_AND_INC_DEC_CHAN = 0x2,  /*!< default */
	AUDIO_UN_CHAN               = 0x3
};
typedef uint8_t audio_zdet_t;

/**
  \brief Audio Zero Detection Time Out Select for ADC.
*/
enum  audio_adc_zdet_tout_e {
	AUDIO_ADC_16384_SAMPLES = 0x0,
	AUDIO_ADC_32768_SAMPLES = 0x1,  /*!< default */
	AUDIO_ADC_65536_SAMPLES = 0x2,
	AUDIO_ADC_64_SAMPLES    = 0x3
};
typedef uint8_t audio_adc_zdet_tout_t;

/**
  \brief Audio DMIC Latch Select.
*/
enum  audio_dmic_latch_e {
	AUDIO_DIMC_RISING = 0x0,
	AUDIO_DIMC_FALLING = 0x1
};
typedef uint8_t audio_dmic_latch_t;

/**
  \brief Audio DMIC Boost Select.
*/
enum  audio_dmic_gain_e {
	AUDIO_DMIC_BOOST_0DB = 0x0,
	AUDIO_DMIC_BOOST_12DB = 0x1,
	AUDIO_DMIC_BOOST_24DB = 0x2,
	AUDIO_DMIC_BOOST_36DB = 0x3
};
typedef uint8_t audio_dmic_gain_t;

/**
  \brief Audio Low Pass Filter frequency Select for SRC.
*/
enum  audio_src_freq_e {
	AUDIO_SRC_31p04KHZ = 0x0,
	AUDIO_SRC_46p92KHZ = 0x1,
	AUDIO_SRC_63p06KHZ = 0x2,
	AUDIO_SRC_79p54KHZ = 0x3
};
typedef uint8_t audio_src_freq_t;

/**
  \brief Audio Silence Debounce.
*/
enum  audio_silence_debounce_e {
	AUDIO_SILE_3840_SAMPLES = 0x0,
	AUDIO_SILE_7680_SAMPLES = 0x1,
	AUDIO_SILE_15360_SAMPLES = 0x2,
	AUDIO_SILE_30720_SAMPLES = 0x3, /*!< default */
	AUDIO_SILE_61440_SAMPLES = 0x4,
	AUDIO_SILE_122880_SAMPLES = 0x5,
	AUDIO_SILE_245760_SAMPLES = 0x6
};
typedef uint8_t audio_silence_debounce_t;

/**
  \brief Audio Silence Level.
*/
enum  audio_silence_Level_e {
	AUDIO_SILE_n78DB = 0x0,
	AUDIO_SILE_n84DB = 0x1,
	AUDIO_SILE_n90DB = 0x2,
	AUDIO_SILE_n102DB = 0x3,
	AUDIO_SILE_n108DB = 0x4,
	AUDIO_SILE_n114DB = 0x5,
	AUDIO_SILE_n126DB = 0x6,
	AUDIO_SILE_n132DB = 0x7
};
typedef uint8_t audio_silence_Level_t;

/**
  \brief Audio Dither Select.
*/
enum  audio_dac_dither_e {
	AUDIO_DITHER_DISABLE = 0x0,
	AUDIO_DITHER_LSB = 0x1,
	AUDIO_DITHER_LSB_ADD1 = 0x2,    /*!< default */
	AUDIO_DITHER_LSB_ADD2 = 0x3
};
typedef uint8_t audio_dac_dither_t;

/**
  \brief Audio Zero Detection Time Out Select for DAC.
*/
enum  audio_dac_zdet_tout_e {
	AUDIO_DAC_16384_SAMPLES = 0x0,  /*!< default */
	AUDIO_DAC_32768_SAMPLES = 0x1,
	AUDIO_DAC_65536_SAMPLES = 0x2,
	AUDIO_DAC_256_SAMPLES   = 0x3
};
typedef uint8_t audio_dac_zdet_tout_t;

/**
  \brief Audio Sidetone HPF Cut Off Frequence.
*/
enum  audio_sidetone_hpf_e {
	AUDIO_ST_120HZ = 0x0,
	AUDIO_ST_239HZ = 0x1,
	AUDIO_ST_358HZ = 0x2,
	AUDIO_ST_477HZ = 0x3,
	AUDIO_ST_597HZ = 0x4,
	AUDIO_ST_716HZ = 0x5,
	AUDIO_ST_835HZ = 0x6,
	AUDIO_ST_955HZ = 0x7
};
typedef uint8_t audio_sidetone_hpf_t;

/**
  \brief Audio Sidetone Volume Select .
*/
enum  audio_sidetone_vol_e {
	AUDIO_ST_n46p5DB = 0x0,
	AUDIO_ST_n45DB = 0x1,
	AUDIO_ST_n43p5DB = 0x2,
	AUDIO_ST_n42DB = 0x3,
	AUDIO_ST_n40p5DB = 0x4,
	AUDIO_ST_n39DB = 0x5,
	AUDIO_ST_n37p5DB = 0x6,
	AUDIO_ST_n36DB = 0x7,

	AUDIO_ST_n34p5DB = 0x8,
	AUDIO_ST_n33DB = 0x9,
	AUDIO_ST_n31p5DB = 0xA,
	AUDIO_ST_n30DB = 0xB,
	AUDIO_ST_n28p5DB = 0xC,
	AUDIO_ST_n27DB = 0xD,
	AUDIO_ST_n25p5DB = 0xE,
	AUDIO_ST_n24DB = 0xF,

	AUDIO_ST_n22p5DB = 0x10,
	AUDIO_ST_n21DB = 0x11,
	AUDIO_ST_n19p5DB = 0x12,
	AUDIO_ST_n18DB = 0x13,
	AUDIO_ST_n16p5DB = 0x14,
	AUDIO_ST_n15DB = 0x15,
	AUDIO_ST_n13p5DB = 0x16,
	AUDIO_ST_n12DB = 0x17,

